cask_args appdir: '/Applications'

tap 'buo/cask-upgrade'
brew "mas"
tap 'homebrew/bundle'

# System Tools
brew 'git'
brew 'zsh'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack'
brew 'ccat'
brew 'bat'
brew 'icdiff'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git-delta'
brew 'duff'
brew 'gitsign'
brew 'gh'
brew 'hg'
brew 'interactive-rebase-tool'
brew 'gti'
brew 'go'
brew 'fzf'
brew 'jq'
brew 'jless'
brew 'node'
brew 'python3'
brew 'openssl'
brew 'openssh'
brew 'protobuf'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'fd'
brew 'wdiff'
brew 'entr'
brew 'direnv'
brew 'bats'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'telnet'
brew 'fortio'
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'parallel'
brew 'screen'
brew 'ncurses'
brew 'pv'
brew 'shfmt'
brew 'ncdu'
brew 'dust'
brew 'z'
brew 'kind'
brew 'terragrunt'

# Containers and Kubernetes
brew 'kubernetes-cli'
brew 'helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'minikube'
brew 'kind'
brew 'docker-machine-driver-vultr' # Didnt work,
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
brew 'ko'
brew 'dive'
brew 'crane'
brew 'gpg'

# Version Control and Signing
brew 'gnupg'
cask 'keybase'

# Development and Code Tools
cask 'visual-studio-code'
brew 'node'
brew 'python@3.13'
brew 'terraform'
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'
brew 'gotests'
brew 'hadolint'
brew 'helm'
brew 'jq'
brew 'k3d'
brew 'kind'
brew 'kubernetes-cli'
brew 'krew'
brew 'kubectx'
brew 'kubeseal'
brew 'libssh'
brew 'qemu'
brew 'lima'
brew 'localstack'
brew 'make'
brew 'minikube'
brew 'opa'
brew 'task'
brew 'terraform'
brew 'tilt'
brew 'traefik'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'speedtest-cli'

# Desktop Software
cask 'slack'
cask 'google-chrome'
cask 'firefox'
cask 'discord'
cask 'vlc'
cask 'whatsapp'
cask 'duckduckgo'         
cask 'cleanmymac'        
cask 'chatgpt'           
cask 'cursor'            
cask 'expressvpn'        
cask 'microsoft-teams'   
cask 'notion'
cask 'docker'
cask 'obs'
cask 'bitwarden'
cask 'figma'
cask 'drawio'
cask 'insomnia'
cask 'postman'



vscode 'streetsidesoftware.code-spell-checker'
#vscode 'amazonwebservices.aws-toolkit-vscode'  #useless 
vscode 'ms-vscode.azure-account'               
vscode 'ms-azuretools.vscode-azureappservice'  
vscode 'ms-vscode.azurecli'                    
vscode 'ms-azuretools.vscode-cosmosdb'         
vscode 'ms-azuretools.azure-dev'               
vscode 'ms-azuretools.vscode-azurefunctions'   
vscode 'ms-azuretools.vscode-azurestaticwebapps'
vscode 'ms-azuretools.vscode-azurestorage'     
vscode 'ms-azuretools.vscode-azureterraform'   
vscode 'ms-azuretools.vscode-azurevirtualmachines'
vscode 'aaron-bond.better-comments'            
vscode 'alefragnani.Bookmarks'                 
vscode 'chouzz.vscode-better-align'
vscode 'twxs.cmake' 
vscode 'ms-vscode.cmake-tools' 
vscode 'ms-vscode-remote.remote-containers' 
vscode 'ms-azuretools.vscode-docker' 
vscode 'IgorSbitnev.error-gutters' 
vscode 'ryu1kn.partial-diff' 
vscode 'donjayamanne.git-extension-pack' 
vscode 'mhutchie.git-graph' 
vscode 'donjayamanne.githistory' 
vscode 'felipecaputo.git-project-manager' 
vscode 'codezombiech.gitignore' 
vscode 'GitLab.gitlab-workflow' 
vscode 'eamodio.gitlens' 
vscode 'golang.go'
vscode 'hashicorp.terraform'
vscode 'ms-python.isort'
vscode 'ZainChen.json' 
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.jupyter-keymap' 
vscode 'ms-toolsai.jupyter-renderers' 
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ritwickdey.LiveServer' 
vscode 'ms-vscode.makefile-tools'
vscode 'DavidAnson.vscode-markdownlint' 
vscode 'yzhang.markdown-all-in-one' 
vscode 'shd101wyy.markdown-preview-enhanced'
vscode 'ms-python.vscode-pylance'
vscode 'ms-python.python'
vscode 'ms-python.debugpy'
vscode 'msjsdiag.vscode-react-native'
vscode 'humao.rest-client'
vscode 'mgtrrz.terraform-completer'
vscode 'denwin.terraform-extension-pack'
vscode 'redhat.vscode-yaml'
vscode 'GitHub.copilot'
vscode 'yzhang.markdown-all-in-one'
vscode 'run-at-scale.terraform-doc-snippets'
vscode 'ms-vscode.powershell'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.azure-account'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-python.isort'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-kubernetes-tools.vscode-aks-tools'
vscode 'ms-azuretools.vscode-docker'
vscode 'mongodb.mongodb-vscode'
vscode 'hediet.vscode-drawio'
vscode 'hashicorp.terraform'
vscode 'golang.go'
vscode 'GitHub.vscode-pull-request-github'
vscode 'github.vscode-github-actions'
vscode 'eamodio.gitlens'
vscode 'DavidAnson.vscode-markdownlint'
vscode 'bierner.markdown-mermaid'
vscode 'dbaeumer.vscode-eslint'
vscode 'formulahendry.auto-close-tag'
vscode 'formulahendry.auto-complete-tag'
vscode 'formulahendry.auto-rename-tag'
vscode 'aaron-bond.better-comments'
vscode 'alefragnani.bookmarks'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'firefox-devtools.vscode-firefox-debug'
vscode 'vsls-contrib.gistfs'
vscode 'codezombiech.gitignore'
vscode 'oderwat.indent-rainbow'
vscode 'infracost.infracost'
vscode 'zainchen.json'
vscode 'shd101wyy.markdown-preview-enhanced'
vscode 'quicktype.quicktype'
vscode 'esbenp.prettier-vscode'
vscode 'mohsen1.prettify-json'
vscode 'alefragnani.project-manager'
vscode 'splunk.splunk'
vscode 'tfsec.tfsec'
vscode 'gruntfuggly.todo-tree'