cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# System Tools
brew 'git'
brew 'zsh'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack'
brew 'ccat'
brew 'bat'
brew 'icdiff'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git-delta'
brew 'dyff'
brew 'gitsign'
brew 'gh'
brew 'hg'
brew 'interactive-rebase-tool'
brew 'gti'
brew 'prm'
brew 'go'
brew 'fzf'
brew 'grv'
brew 'jq'
brew 'jless'
brew 'node'
brew 'python3'
brew 'openssl'
brew 'openssh'
brew 'protobuf'
brew 'prototool'
brew 'dog'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'fd'
brew 'wdiff'
brew 'entr'
brew 'direnv'
brew 'bats'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'
brew 'fortio'
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'parallel'
brew 'screen'
brew 'ncurses'
brew 'pv'
brew 'shfmt'
brew 'ncdu'
brew 'dust'
brew 'z'
brew 'kind'
brew 'multipass'

# Containers and Kubernetes
brew 'kubernetes-cli'
brew 'helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'minikube'
brew 'kind'
brew 'docker-machine-driver-hyperkit'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
brew 'ko'
brew 'dive'
brew 'crane'
brew 'gpg'

# Version Control and Signing
brew 'gnupg'
cask 'keybase'

# Development and Code Tools
cask 'iterm2'
cask 'visual-studio-code'
brew 'node'
brew 'python@3.13'
brew 'terraform'
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'
brew 'gotests'
brew 'hadolint'
brew 'helm'
brew 'jq'
brew 'k3d'
brew 'kind'
brew 'kubernetes-cli'
brew 'krew'
brew 'kubectx'
brew 'kubeseal'
brew 'libssh'
brew 'qemu'
brew 'lima'
brew 'localstack'
brew 'make'
brew 'minikube'
brew 'opa'
brew 'task'
brew 'terraform'
brew 'tilt'
brew 'traefik'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yq'
brew 'zsh'

# Desktop Software
cask 'slack'
cask 'google-chrome'
cask 'firefox'
cask 'discord'
cask 'vlc'
cask 'whatsapp'
cask 'duckduckgo'         
cask 'cleanmymac'        
cask 'chatgpt'           
cask 'cursor'            
cask 'expressvpn'        
cask 'microsoft-teams'   
cask 'spectacle'         
cask 'speedtest'
cask 'notion'
cask 'docker'
cask 'obs'

vscode 'ms-vscode.vscode-azure-resources'      # Azure Resources
vscode 'streetsidesoftware.code-spell-checker' # Code Spell Checker
vscode 'amazonwebservices.aws-toolkit-vscode'  # AWS Toolkit
vscode 'ms-vscode.azure-account'               # Azure Account
vscode 'ms-azuretools.vscode-azureappservice'  # Azure App Service
vscode 'ms-vscode.vscode-azurecli'             # Azure CLI Tools
vscode 'ms-azuretools.azure-container-apps'    # Azure Container Apps
vscode 'ms-azuretools.vscode-cosmosdb'         # Azure Database
vscode 'ms-azuretools.azure-dev'               # Azure Developer CLI
vscode 'ms-azuretools.vscode-azurefunctions'   # Azure Functions
vscode 'ms-azuretools.vscode-azurestaticwebapps' # Azure Static Web Apps
vscode 'ms-azuretools.vscode-azurestorage'     # Azure Storage
vscode 'ms-azuretools.vscode-azureterraform'   # Azure Terraform
vscode 'ms-vscode.vscode-azuretools'           # Azure Tools
vscode 'ms-azuretools.vscode-azurevirtualmachines' # Azure Virtual Machines
vscode 'aaron-bond.better-comments'            # Better Comments
vscode 'alefragnani.Bookmarks'                 # Bookmarks
vscode 'wwm.better-align'                      # Bracket Lens
vscode 'twxs.cmake'                            # CMake
vscode 'ms-vscode.cmake-tools'                 # CMake Tools
vscode 'ms-vscode-remote.remote-containers'    # Dev Containers
vscode 'ms-azuretools.vscode-docker'           # Docker
vscode 'Gruntfuggly.error-gutters'             # Error Gutters
vscode 'shaharkazaz.git-branch-warnings'       # Git Branch Warnings
vscode 'ryu1kn.partial-diff'                   # Git Diff and Merge Tool
vscode 'donjayamanne.git-extension-pack'       # Git Extension Pack
vscode 'mhutchie.git-graph'                    # Git Graph
vscode 'donjayamanne.githistory'               # Git History
vscode 'felipecaputo.git-project-manager'      # Git Project Manager
vscode 'codezombiech.gitignore'                # gitignore
vscode 'GitLab.gitlab-workflow'                # GitLab Workflow
vscode 'eamodio.gitlens'                       # GitLens - Git Supercharged
vscode 'golang.go'                             # Go
vscode 'hashicorp.terraform'                   # HashiCorp Terraform
vscode 'ms-python.isort'                       # isort (Python)
vscode 'ZainChen.json'                         # JSON
vscode 'ms-toolsai.jupyter'                    # Jupyter
vscode 'ms-toolsai.vscode-jupyter-cell-tags'   # Jupyter Cell Tags
vscode 'ms-toolsai.jupyter-keymap'             # Jupyter Keymap
vscode 'ms-toolsai.jupyter-renderers'          # Jupyter Notebook Renderers
vscode 'ms-toolsai.vscode-jupyter-slideshow'   # Jupyter Slide Show
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools' # Kubernetes
vscode 'ritwickdey.LiveServer'                 # Live Server
vscode 'ms-vscode.makefile-tools'              # Makefile Tools
vscode 'DavidAnson.vscode-markdownlint'        # Markdownlint
vscode 'yzhang.markdown-all-in-one'            # Markdown All in One
vscode 'shd101wyy.markdown-preview-enhanced'   # Markdown Preview Enhanced
vscode 'ms-python.vscode-pylance'              # Pylance
vscode 'ms-python.python'                      # Python
vscode 'ms-python.debugpy'                     # Python Debugger
vscode 'msjsdiag.vscode-react-native'          # React Native Tools
vscode 'humao.rest-client'                     # REST Client
vscode 'erd0s.terraform-completer'             # Terraform Completer
vscode 'terraform-tools.terraform-extension-pack' # Terraform Extension Pack
vscode 'redhat.vscode-yaml'                    # YAML (Red Hat)
vscode 'GitHub.copilot'                        # GitHub Copilot
vscode 'yzhang.markdown-all-in-one'
vscode 'run-at-scale.terraform-doc-snippets'
vscode 'ms-vscode.powershell'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.azure-account'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-python.isort'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-kubernetes-tools.vscode-aks-tools'
vscode 'ms-azuretools.vscode-docker'
vscode 'mongodb.mongodb-vscode'
vscode 'hediet.vscode-drawio'
vscode 'hashicorp.terraform'
vscode 'golang.go'
vscode 'GitHub.vscode-pull-request-github'
vscode 'github.vscode-github-actions'
vscode 'eamodio.gitlens'
vscode 'DavidAnson.vscode-markdownlint'
vscode 'bierner.markdown-mermaid'
vscode 'dbaeumer.vscode-eslint'
vscode 'formulahendry.auto-close-tag'
vscode 'formulahendry.auto-complete-tag'
vscode 'formulahendry.auto-rename-tag'
vscode 'aaron-bond.better-comments'
vscode 'alefragnani.bookmarks'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'firefox-devtools.vscode-firefox-debug'
vscode 'vsls-contrib.gistfs'
vscode 'codezombiech.gitignore'
vscode 'oderwat.indent-rainbow'
vscode 'infracost.infracost'
vscode 'zainchen.json'
vscode 'shd101wyy.markdown-preview-enhanced'
vscode 'quicktype.paste-json-as-code'
vscode 'esbenp.prettier-vscode'
vscode 'mohsen1.prettify-json'
vscode 'alefragnani.project-manager'
vscode 'splunk.splunk'
vscode 'mauve.terraform'
vscode 'stefanvanhove.terraform-links'
vscode 'mohammed-yahya.vscode-terraform-extension-pack'
vscode 'tfsec.tfsec-vscode'
vscode 'gruntfuggly.todo-tree'
vscode 'bridgecrew.checkov'
